---
kind: type
id: T:Autodesk.Revit.DB.InSessionViewSheetSet
source: html/61a44d58-c862-5fb6-6a06-dd3d3abac585.htm
---
# Autodesk.Revit.DB.InSessionViewSheetSet

Represents the in-session ViewSheetSet.

## Syntax (C#)
```csharp
public class InSessionViewSheetSet : IViewSheetSet,
	IDisposable
```

## Remarks
The in-session ViewSheetSet can't be stored in document.